Good step forward, but still work to be done. With the code from master, I created three VDCs and then updated only the following parameters of one VDC ("vdc-pay" one below):
1. cpu_guaranteed
2. memory_guaranteed
3. compute_capacity.cpu.limit
4. compute_capacity.memory.limit

However, `terraform plan` showed:
- Expected: cpu_guaranteed and memory_guaranteed as simple changes
- Unexpected: whole compute_capacity sub-block being recreated and inappropriate ` -> null` changes
- Unexpected: `~ cpu_speed = 0 -> 1000` change in a different VDC which I haven't touched at all! This one always pops up!

Output:

```
Terraform will perform the following actions:

  # vcd_org_vdc.vdc-pay will be updated in-place
  ~ resource "vcd_org_vdc" "vdc-pay" {
        allocation_model         = "AllocationVApp"
      ~ cpu_guaranteed           = 0.55 -> 0.53
        cpu_speed                = 1000
        delete_force             = true
        delete_recursive         = true
        description              = "Terraform created VDC"
        enable_fast_provisioning = true
        enable_thin_provisioning = true
        enable_vm_discovery      = false
        enabled                  = true
        id                       = "urn:vcloud:vdc:394347a6-4c74-4f48-b627-7841973c13e5"
      ~ memory_guaranteed        = 0.55 -> 0.52
        name                     = "TfPayVDC"
        network_pool_name        = "vc1-TestbedCluster-09:13:18-VXLAN-NP"
        network_quota            = 5
        nic_quota                = 0
        org                      = "Solpan"
        provider_vdc_name        = "vc1-TestbedCluster-09:13:18"
        vm_quota                 = 0

      - compute_capacity {
          - cpu {
              - allocated = 0 -> null
              - limit     = 3123 -> null
              - overhead  = 0 -> null
              - reserved  = 0 -> null
              - used      = 0 -> null
            }

          - memory {
              - allocated = 0 -> null
              - limit     = 4123 -> null
              - overhead  = 0 -> null
              - reserved  = 0 -> null
              - used      = 0 -> null
            }
        }
      + compute_capacity {
          + cpu {
              + allocated = (known after apply)
              + limit     = 3110
              + overhead  = (known after apply)
              + reserved  = (known after apply)
              + used      = (known after apply)
            }

          + memory {
              + allocated = (known after apply)
              + limit     = 4000
              + overhead  = (known after apply)
              + reserved  = (known after apply)
              + used      = (known after apply)
            }
        }

        storage_profile {
            default = true
            enabled = true
            limit   = 0
            name    = "*"
        }
        storage_profile {
            default = false
            enabled = true
            limit   = 0
            name    = "Development"
        }
    }

  # vcd_org_vdc.vdc-reservation will be updated in-place
  ~ resource "vcd_org_vdc" "vdc-reservation" {
        allocation_model         = "ReservationPool"
        cpu_guaranteed           = 1
      ~ cpu_speed                = 0 -> 1000
        delete_force             = true
        delete_recursive         = true
        description              = "Terraform created VDC"
        enable_fast_provisioning = true
        enable_thin_provisioning = true
        enable_vm_discovery      = false
        enabled                  = true
        id                       = "urn:vcloud:vdc:6b1cea8a-c3d3-43fa-ae05-4ec1021b84fd"
        memory_guaranteed        = 1
        name                     = "TfReservationVDC"
        network_pool_name        = "vc1-TestbedCluster-09:13:18-VXLAN-NP"
        network_quota            = 5
        nic_quota                = 0
        org                      = "Solpan"
        provider_vdc_name        = "vc1-TestbedCluster-09:13:18"
        vm_quota                 = 0

        compute_capacity {
            cpu {
                allocated = 5123
                limit     = 0
                overhead  = 0
                reserved  = 0
                used      = 0
            }

            memory {
                allocated = 3123
                limit     = 0
                overhead  = 0
                reserved  = 0
                used      = 0
            }
        }

        storage_profile {
            default = true
            enabled = true
            limit   = 0
            name    = "*"
        }
        storage_profile {
            default = false
            enabled = true
            limit   = 0
            name    = "Development"
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

`terraform apply` output:

```
vcd_org_vdc.vdc-reservation: Refreshing state... [id=urn:vcloud:vdc:6b1cea8a-c3d3-43fa-ae05-4ec1021b84fd]
vcd_org_vdc.vdc-allocation: Refreshing state... [id=urn:vcloud:vdc:63044dae-e2e0-4429-9a58-5565269f01e8]
vcd_org_vdc.vdc-pay: Refreshing state... [id=urn:vcloud:vdc:394347a6-4c74-4f48-b627-7841973c13e5]
vcd_org_vdc.vdc-reservation: Modifying... [id=urn:vcloud:vdc:6b1cea8a-c3d3-43fa-ae05-4ec1021b84fd]
vcd_org_vdc.vdc-pay: Modifying... [id=urn:vcloud:vdc:394347a6-4c74-4f48-b627-7841973c13e5]
vcd_org_vdc.vdc-pay: Still modifying... [id=urn:vcloud:vdc:394347a6-4c74-4f48-b627-7841973c13e5, 10s elapsed]
vcd_org_vdc.vdc-reservation: Still modifying... [id=urn:vcloud:vdc:6b1cea8a-c3d3-43fa-ae05-4ec1021b84fd, 10s elapsed]
vcd_org_vdc.vdc-pay: Modifications complete after 11s [id=urn:vcloud:vdc:394347a6-4c74-4f48-b627-7841973c13e5]
vcd_org_vdc.vdc-reservation: Modifications complete after 11s [id=urn:vcloud:vdc:6b1cea8a-c3d3-43fa-ae05-4ec1021b84fd]
```

